app/controllers/comments_controller.rb

def create
  @post = Post.find(params[:post_id])
  @comment = @post.comments.create(comment_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("username", "body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "tester1 "], ["body", "test comment"], ["post_id", 1], ["created_at", "2019-09-06 13:42:12.306366"], ["updated_at", "2019-09-06 13:42:12.306366"]]