app/controllers/posts_controller.rb

  def index
    @post = Post.all
---
SELECT "posts".* FROM "posts"

  def update
    @post = Post.find(params[:id])
    if(@post.update(post_params))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "body" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "test_1_title111"], ["body", "Text for first test111"], ["updated_at", "2019-09-06 13:11:52.109237"], ["id", 1]]

  def create
    #render отладчик для проверки данных
    #render plain: params[:post].inspect
    @post = Post.new(post_params)
    #можем сохранить, если пройдена валидация
    #@post.save
    if(@post.save)
---
INSERT INTO "posts" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test_1_title"], ["body", "Text for first test"], ["created_at", "2019-09-06 11:54:07.331817"], ["updated_at", "2019-09-06 11:54:07.331817"]]